# SpatialElementBoundaryOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundaryOptions Constructor
SpatialElementBoundaryOptions Class See Also
---
Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SpatialElementBoundaryOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SpatialElementBoundaryOptions()
```

# See Also
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace